; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	image0 - mode
	thermograph2 - mode
	spectrograph4 - mode
	image1 - mode
	thermograph3 - mode
	GroundStation2 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	Star1 - direction
	Planet4 - direction
	Star5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 spectrograph4)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 image0)
	(supports instrument5 thermograph3)
	(supports instrument5 spectrograph4)
	(calibration_target instrument5 Star1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon10)
	(supports instrument6 thermograph2)
	(supports instrument6 thermograph3)
	(calibration_target instrument6 Star1)
	(supports instrument7 image1)
	(supports instrument7 thermograph2)
	(calibration_target instrument7 GroundStation0)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet4)
	(supports instrument8 image1)
	(supports instrument8 spectrograph4)
	(calibration_target instrument8 GroundStation3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon11)
	(supports instrument9 thermograph3)
	(supports instrument9 image1)
	(supports instrument9 spectrograph4)
	(calibration_target instrument9 Star1)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation3)
)
(:goal (and
	(pointing satellite3 Star7)
	(have_image Planet4 image0)
	(have_image Star5 spectrograph4)
	(have_image Phenomenon6 image1)
	(have_image Star7 image0)
	(have_image Planet8 image0)
	(have_image Phenomenon9 image1)
	(have_image Phenomenon10 thermograph3)
	(have_image Phenomenon11 image1)
	(have_image Phenomenon13 thermograph2)
))

)

; plan
1. (switch_on instrument9 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument9)
   goals met: 0 of 10
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 10
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 10
4. (turn_to satellite4 phenomenon10 groundstation3)
   deleted: (pointing satellite4 groundstation3)
   added: (pointing satellite4 phenomenon10)
   goals met: 0 of 10
5. (turn_to satellite4 star1 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 star1)
   goals met: 0 of 10
6. (calibrate satellite4 instrument9 star1)
   added: (calibrated instrument9)
   goals met: 0 of 10
7. (turn_to satellite4 phenomenon10 star1)
   deleted: (pointing satellite4 star1)
   added: (pointing satellite4 phenomenon10)
   goals met: 0 of 10
8. (take_image satellite4 phenomenon10 instrument9 thermograph3)
   added: (have_image phenomenon10 thermograph3)
   goals met: 1 of 10
9. (turn_to satellite4 phenomenon11 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 phenomenon11)
   goals met: 1 of 10
10. (take_image satellite4 phenomenon11 instrument9 image1)
   added: (have_image phenomenon11 image1)
   goals met: 2 of 10
11. (turn_to satellite4 phenomenon6 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 phenomenon6)
   goals met: 2 of 10
12. (take_image satellite4 phenomenon6 instrument9 image1)
   added: (have_image phenomenon6 image1)
   goals met: 3 of 10
13. (turn_to satellite4 phenomenon9 phenomenon6)
   deleted: (pointing satellite4 phenomenon6)
   added: (pointing satellite4 phenomenon9)
   goals met: 3 of 10
14. (take_image satellite4 phenomenon9 instrument9 image1)
   added: (have_image phenomenon9 image1)
   goals met: 4 of 10
15. (turn_to satellite4 star5 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 star5)
   goals met: 4 of 10
16. (take_image satellite4 star5 instrument9 spectrograph4)
   added: (have_image star5 spectrograph4)
   goals met: 5 of 10
17. (turn_to satellite3 star7 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 star7)
   goals met: 6 of 10
18. (turn_to satellite1 groundstation3 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 groundstation3)
   goals met: 6 of 10
19. (calibrate satellite1 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 6 of 10
20. (turn_to satellite1 phenomenon13 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 phenomenon13)
   goals met: 6 of 10
21. (take_image satellite1 phenomenon13 instrument3 thermograph2)
   added: (have_image phenomenon13 thermograph2)
   goals met: 7 of 10
22. (turn_to satellite0 groundstation0 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation0)
   goals met: 7 of 10
23. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 7 of 10
24. (turn_to satellite0 planet4 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet4)
   goals met: 7 of 10
25. (take_image satellite0 planet4 instrument0 image0)
   added: (have_image planet4 image0)
   goals met: 8 of 10
26. (turn_to satellite0 planet8 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 planet8)
   goals met: 8 of 10
27. (take_image satellite0 planet8 instrument0 image0)
   added: (have_image planet8 image0)
   goals met: 9 of 10
28. (turn_to satellite0 star7 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star7)
   goals met: 9 of 10
29. (take_image satellite0 star7 instrument0 image0)
   added: (have_image star7 image0)
   goals met: 10 of 10
